<?php
/**
 * @Desc:代码库
 * @author: hbh
 * @Time: 2020/4/9   14:55
 */
return [
    /*
    |--------------------------------------------------------------------------
    |   公共业务代码
    |--------------------------------------------------------------------------
    |
    */
    0 => "操作成功",     //默认
    -1 => "操作不成功",
    -2 => "参数错误",

    4 => "token不存在，或是已经失效，请从新登录",


    // HTTP 客户端请求
    304 => 'HTTP缓存有效',
    400 => '参数错误',
    401 => '（未授权）身份验证失败',
    403 => '请求成功，但是该用户没有权限',
    404 => '请求的资源不存在或地址不存在',
    405 => '该http方法不被允许',
    410 => '这个url对应的资源现在不可用',
    415 => '请求类型错误',
    422 => '校验错误时用',
    429 => '请求过多',

    // Server Error 5xx
    500 => 'Internal Server Error',
    501 => 'Not Implemented',
    502 => 'Bad Gateway',
    503 => 'Service Unavailable',
    504 => 'Gateway Timeout',
    505 => 'HTTP Version Not Supported',
    509 => 'Bandwidth Limit Exceeded',


    //  用户类10
    //用户登录1010
    101001 => '用户名或密码错误！',
    101002 => '用户名不存在！',
    101003 => '密码错误！',
    101004 => '验证码错误！',
    101005 => '用户不存在！',
    101006 => '用户名必须是以字母开头，只能包含字母数字下划线和减号，6到18位！',
    101007 => '密码为6-16位，,至少有一个数字，一个大写字母，一个小写字母和一个特殊字符',
    101008 => '昵称为1-20位',

    //用户修改信息 1020
    102001 => '手机号已被注册',
    102002 => '邮箱已被注册',
    102003 => '用户名已存在',


    //文件类 40
    // 文件上传4010
    401001 => '未指定上传文件名或文件',
    401002 => '文件格式异常',
    401003 => '文件读取异常',
    401004 => '未指定图片应用类型',
    401005 => '该图片已经被上传过',


];
